In [1]:
import pandas as pd
import numpy as np
import matplotlib

In [2]:
pd.__version__,np.__version__,matplotlib.__version__

('1.0.3', '1.19.1', '3.1.3')

In [6]:
df  = pd.DataFrame(data={
    'feature1': [np.nan, 3, 6, 9, 12, 15, np.nan],
    'feature2': [100, np.nan, 200, 300, np.nan, np.nan, 600],
    'feature3': [1000, 500, 2000, 3000, 4000, 6000, 8000]
})
df

   feature1  feature2  feature3
0       NaN     100.0      1000
1       3.0       NaN       500
2       6.0     200.0      2000
3       9.0     300.0      3000
4      12.0       NaN      4000
5      15.0       NaN      6000
6       NaN     600.0      8000

In [7]:
df.isnull()

   feature1  feature2  feature3
0      True     False     False
1     False      True     False
2     False     False     False
3     False     False     False
4     False      True     False
5     False      True     False
6      True     False     False

In [9]:
df.isnull().sum()

feature1    2
feature2    3
feature3    0
dtype: int64

In [10]:
df.isnull().sum().sum()

5

In [11]:
#pad method fills the previous value in the NAN
df.fillna(method='pad', limit=1)

   feature1  feature2  feature3
0       NaN     100.0      1000
1       3.0     100.0       500
2       6.0     200.0      2000
3       9.0     300.0      3000
4      12.0     300.0      4000
5      15.0       NaN      6000
6      15.0     600.0      8000

In [12]:
#limit attribute indicates how many consecutive NAN should be filled
df.fillna(method='pad', limit=2)

   feature1  feature2  feature3
0       NaN     100.0      1000
1       3.0     100.0       500
2       6.0     200.0      2000
3       9.0     300.0      3000
4      12.0     300.0      4000
5      15.0     300.0      6000
6      15.0     600.0      8000

In [13]:
#backfill, the values are filled in the reverse order
df.fillna(method='bfill')

   feature1  feature2  feature3
0       3.0     100.0      1000
1       3.0     200.0       500
2       6.0     200.0      2000
3       9.0     300.0      3000
4      12.0     600.0      4000
5      15.0     600.0      6000
6       NaN     600.0      8000

In [14]:
#frontfill, same as pad bt with no limit factor
df.fillna(method='ffill')

   feature1  feature2  feature3
0       NaN     100.0      1000
1       3.0     100.0       500
2       6.0     200.0      2000
3       9.0     300.0      3000
4      12.0     300.0      4000
5      15.0     300.0      6000
6      15.0     600.0      8000

In [15]:
#axis=0 means row i.e. we will drop the rows which contains NAN
df.dropna(axis=0)

   feature1  feature2  feature3
2       6.0     200.0      2000
3       9.0     300.0      3000

In [16]:
df.dropna(axis=1)

   feature3
0      1000
1       500
2      2000
3      3000
4      4000
5      6000
6      8000

In [18]:
#here we are dropping the rows where more than 10% of the data is missing
df.dropna(thresh=int(df.shape[0] * .9), axis=1)

   feature3
0      1000
1       500
2      2000
3      3000
4      4000
5      6000
6      8000

In [19]:
df.shape[0]*.9

6.3

In [20]:
#fills the missing values of that column with the mean of the remaning values in that column
df['feature1'].fillna(df['feature1'].mean())

0     9.0
1     3.0
2     6.0
3     9.0
4    12.0
5    15.0
6     9.0
Name: feature1, dtype: float64

In [22]:
#values are filled looking at the previous and next values
df['feature2'].interpolate()

0    100.0
1    150.0
2    200.0
3    300.0
4    400.0
5    500.0
6    600.0
Name: feature2, dtype: float64